let industry = {"status": 200, "data": [{"name": "计算机软件", "y": 20.34}, {"name": "企业服务", "y": 1.37}, {"name": "信息安全", "y": 1.89}, {"name": "互联网", "y": 19.17}, {"name": "电子商务", "y": 3.87}, {"name": "智能硬件", "y": 4.46}, {"name": "移动互联网", "y": 1.63}, {"name": "原材料及加工/模具", "y": 0.28}, {"name": "医疗健康", "y": 1.06}, {"name": "游戏", "y": 4.48}, {"name": "文化艺术/娱乐", "y": 0.83}, {"name": "通信/网络设备", "y": 4.03}, {"name": "仪器仪表/工业自动化", "y": 1.23}, {"name": "计算机服务", "y": 3.35}, {"name": "银行", "y": 0.17}, {"name": "建筑材料", "y": 0.19}, {"name": "社交网络与媒体", "y": 0.68}, {"name": "大数据", "y": 2.22}, {"name": "医疗器械", "y": 0.8}, {"name": "家政服务", "y": 0.02}, {"name": "财务/审计/税务", "y": 0.09}, {"name": "社交网络", "y": 0.21}, {"name": "其他行业", "y": 1.11}, {"name": "电子/硬件开发", "y": 1.08}, {"name": "培训/辅导机构", "y": 0.5}, {"name": "人工智能", "y": 0.85}, {"name": "电力/热力/燃气/水利", "y": 0.31}, {"name": "广告/公关/会展", "y": 0.47}, {"name": "动力电池", "y": 0.09}, {"name": "自动化设备", "y": 0.78}, {"name": "仪器仪表", "y": 0.38}, {"name": "电子/半导体/集成电路", "y": 1.7}, {"name": "保健/养生", "y": 0.02}, {"name": "进出口贸易", "y": 0.52}, {"name": "铁路/船舶/航空/航天制造", "y": 0.31}, {"name": "在线教育", "y": 0.33}, {"name": "生活服务(O2O)", "y": 0.54}, {"name": "印刷/包装/造纸", "y": 0.17}, {"name": "消费电子", "y": 0.14}, {"name": "咨询", "y": 0.52}, {"name": "汽车研发/制造", "y": 1.06}, {"name": "工程施工", "y": 0.52}, {"name": "批发/零售", "y": 0.64}, {"name": "半导体/芯片", "y": 0.75}, {"name": "其他专业服务", "y": 0.52}, {"name": "分类信息", "y": 0.07}, {"name": "其他生活服务", "y": 0.54}, {"name": "机械设备/机电/重工", "y": 1.01}, {"name": "餐饮", "y": 0.24}, {"name": "其他新能源", "y": 0.14}, {"name": "物联网", "y": 0.09}, {"name": "互联网金融", "y": 0.87}, {"name": "医疗服务", "y": 0.35}, {"name": "汽车零部件", "y": 0.83}, {"name": "学术/科研", "y": 0.47}, {"name": "跨境物流", "y": 0.02}, {"name": "房屋建筑工程", "y": 0.05}, {"name": "广告营销", "y": 0.35}, {"name": "O2O", "y": 0.17}, {"name": "专用设备", "y": 0.4}, {"name": "4S店/后市场", "y": 0.17}, {"name": "快递", "y": 0.07}, {"name": "交通/运输", "y": 0.14}, {"name": "新零售", "y": 0.17}, {"name": "人力资源服务", "y": 0.5}, {"name": "云计算", "y": 0.05}, {"name": "运营商/增值服务", "y": 0.33}, {"name": "基金", "y": 0.12}, {"name": "广播/影视", "y": 0.28}, {"name": "环保", "y": 0.47}, {"name": "农/林/牧/渔", "y": 0.21}, {"name": "建筑设计", "y": 0.45}, {"name": "房地产开发经营", "y": 0.19}, {"name": "物流/仓储", "y": 0.09}, {"name": "租赁/拍卖/典当/担保", "y": 0.02}, {"name": "日化", "y": 0.07}, {"name": "法律", "y": 0.05}, {"name": "学前教育", "y": 0.07}, {"name": "通用设备", "y": 0.24}, {"name": "玩具/礼品", "y": 0.02}, {"name": "学校/学历教育", "y": 0.05}, {"name": "音乐/视频/阅读", "y": 0.12}, {"name": "休闲/娱乐", "y": 0.05}, {"name": "房地产中介/租赁", "y": 0.02}, {"name": "计算机硬件", "y": 1.04}, {"name": "检测/认证", "y": 0.07}, {"name": "光伏", "y": 0.21}, {"name": "即时配送", "y": 0.02}, {"name": "政府/公共事业", "y": 0.17}, {"name": "化工", "y": 0.21}, {"name": "新能源", "y": 0.28}, {"name": "投资/融资", "y": 0.12}, {"name": "家用电器", "y": 0.28}, {"name": "新闻/出版", "y": 0.12}, {"name": "计算机/通信/其他电子设备", "y": 0.09}, {"name": "电气机械/器材", "y": 0.24}, {"name": "装修装饰", "y": 0.21}, {"name": "检测/认证/知识产权", "y": 0.09}, {"name": "物业管理", "y": 0.09}, {"name": "服装/纺织", "y": 0.12}, {"name": "旅游/景区", "y": 0.02}, {"name": "食品/饮料/烟酒", "y": 0.09}, {"name": "新能源汽车", "y": 0.02}, {"name": "家具/家电/家居", "y": 0.05}, {"name": "石油/石化", "y": 0.14}, {"name": "金属制品", "y": 0.07}, {"name": "储能", "y": 0.14}, {"name": "汽车智能网联", "y": 0.02}, {"name": "智能硬件/消费电子", "y": 0.09}, {"name": "非金属矿物制品", "y": 0.02}, {"name": "酒店/民宿", "y": 0.05}, {"name": "非盈利机构", "y": 0.12}, {"name": "职业培训", "y": 0.02}, {"name": "客运服务", "y": 0.02}, {"name": "专利/商标/知识产权", "y": 0.09}, {"name": "回收/维修", "y": 0.05}, {"name": "生物/制药", "y": 0.05}, {"name": "其他制造业", "y": 0.02}, {"name": "装卸搬运和仓储业", "y": 0.05}, {"name": "机电工程", "y": 0.07}, {"name": "其他消费品", "y": 0.05}, {"name": "美容/美发", "y": 0.12}, {"name": "美容", "y": 0.05}]};

$(function () {
    let obj = industry;

    Highcharts.chart('industry', {
        chart: {
            plotBackgroundColor: null,
            plotBorderWidth: null,
            plotShadow: false,
            type: 'pie',
            backgroundColor: 'rgba(0,0,0,0)'
        },
        title: {
            text: '专业占比'
        },
        tooltip: {
            pointFormat: '{series.name}: <b>{point.percentage:.1f}%</b>'
        },
        plotOptions: {
            pie: {
                allowPointSelect: true,
                cursor: 'pointer',
                dataLabels: {
                    enabled: true,
                    format: '<b>{point.name}</b>: {point.percentage:.1f} %',
                    style: {
                        color: (Highcharts.theme && Highcharts.theme.contrastTextColor) || 'black'
                    }
                }
            }
        },
        series: [{
            name: 'Brands',
            colorByPoint: true,
            data: obj.data,
        }],
    });

});
